from collections import Counter

"""
برنامه ای برای بدیت آوردن تعداد تکرار هر رقم در یک لیست عددی می نویسیم که:
1- میاد درون یک حلقه ارقام هر عدد رو جدا میکنه
2-ارقام رو درون یک لیست دیگه میریزه
3- با استفاده از تابع داخلی Counter  تعداد تکرار هر عضو مجموعه ارقام رو بدست میاره
4- پرتکرارترین 3 رقم رو بدست میاره
5- چون تابع مذکور نتیجه رو بصورت یک دیکشنری تولید میکنه با یک حلقه نتایج رو بصورت کلید-مقدار(کلید همان رقم و مقدار هم تعداد تکرارش درون مجموعه) چاپ میکنیم
6- در آخر هم پرتکرارترین سه رقم رو چون لیستی از تاپل هست ابتدا به دیکشنری تبدیل میکنیم تا کلید هر تاپل رو بدست بیاریم و بعد نتیجه رو بصورت یک لیست چاپ میکنیم
"""

# لیستی از اعداد
numberList = [12, 25, 1, 5, 9875, 32, 11, 54, 65, 70, 55, 44, 69, 2, 8, 6, 879, 568, 1245]

# جدا کردن ارقام اعداد و ریختن ارقام در یک لیست
digitsList = []
for i in numberList:
    [digitsList.append(int(n)) for n in str(i)]

# شمردن تعداد تکرار هر رقم در لیست
result = Counter(digitsList)

# پرتکرارترین 3 رقم در لیست
threePopulateNumbers = result.most_common(3)

# چاپ هر رقم به همراه تعداد تکرار آن
for k, v in result.items():
    print(k, "=>", v)

# چاپ پرتکرارترین 3 رقم
print(list(dict(threePopulateNumbers).keys()))
